Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectAttributes Methods
The EmbeddedObjectAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the specified attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
EmbeddedObjectAttributes Class
Tekla.Structures.Drawing Namespace